schemas/src/main/resources/schemas/interactions/StoreLogInteraction/StoreLogInteraction_1.0_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Inera AB licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->	
<wsdl:definitions name='StoreLogInteraction'
	xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/'
	xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/'
	xmlns:xs='http://www.w3.org/2001/XMLSchema'
	xmlns:tjsr='urn:riv:ehr:log:store:StoreLogResponder:1'
	xmlns:itr='urn:riv:itintegration:registry:1'
	xmlns:tns='urn:riv:ehr:log:store:StoreLog:1:rivtabp21'
	targetNamespace='urn:riv:ehr:log:store:StoreLog:1:rivtabp21'>

	<wsdl:documentation>
		 Tjänsteinteraktionens namn: StoreLog
		 Beskrivning: 
		   Tjänst som sparar en eller flera loggposter i loggtjänsten för att möjliggöra uppföljning enligt PDL. Loggposter sparas i ett arkiv med löpnummer samt signeras för att säkerställa integriteten av loggposter. 
		   Loggposter valideras enligt schema. Resultat av anropet returneras i ett Result objekt med statuskod. Vi fel sparas ej loggposter i loggtjänsten.
		 Revisioner: 
		 Tjänstedomän: log:store
		 Tjänsteinteraktionstyp: Fråga-Svar
		 WS-profil: RIVTABP21
		 Förvaltas av: Inera AB
	</wsdl:documentation>
	
	<wsdl:types>
		<xs:schema targetNamespace='urn:riv:ehr:log:store:StoreLog:1:rivtabp21'>
			<xs:import schemaLocation='StoreLogResponder_1.0.xsd' namespace='urn:riv:ehr:log:store:StoreLogResponder:1' />
			<xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
		</xs:schema>
	</wsdl:types>
	
		
	<wsdl:message name='StoreLogRequest'>
		<wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
			<wsdl:documentation>Ineras nationella HSA-id SE165565594230-1000.</wsdl:documentation>
		</wsdl:part>
	
		<wsdl:part name='parameters' element='tjsr:StoreLogRequest' />
	</wsdl:message>

	<wsdl:message name='StoreLogResponse'>
		<wsdl:part name='parameters' element='tjsr:StoreLogResponse' />
	</wsdl:message>

	<wsdl:portType name='StoreLogResponderInterface'>
		<wsdl:operation name='StoreLog'>
			<wsdl:input message='tns:StoreLogRequest' />
			<wsdl:output message='tns:StoreLogResponse' />
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name='StoreLogResponderBinding' type='tns:StoreLogResponderInterface'>
		<soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
		<wsdl:operation name='StoreLog'>
			<soap:operation soapAction='urn:riv:ehr:log:store:StoreLogResponder:1:StoreLog' style='document' />
			<wsdl:input>
				<soap:header use='literal' message='tns:StoreLogRequest' part='LogicalAddress' />
				<soap:body use='literal' parts='parameters' />
			</wsdl:input>
			<wsdl:output>
				<soap:body use='literal' />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name='StoreLogResponderService'>
		<wsdl:port name='StoreLogResponderPort' binding='tns:StoreLogResponderBinding'>
			<soap:address location='http://tempuri.org' />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
